repository/app/controllers/application_controller.rb

    def home
        output = "<html><head><title>PPLDID - DID for People</title>"
        output +="</head><body>"
        output +="<h1>PPLDID Repository</h1>"
        output +="<p>Version: " + VERSION.to_s + " (pplcdid gem v" + Gem.loaded_specs["pplcdid"].version.to_s + ")</p>"
        output +="<p><strong>Statistics</strong> for this repository:</p><ul>"
        output +="<li>DIDs: " + Did.count.to_s + "</li>"
        output +="<li>Logs: " + Log.count.to_s + "</li>"
---
SELECT COUNT(*) FROM "dids"
SELECT COUNT(*) FROM "logs"