repository/app/controllers/logs_controller.rb

    def show
        id = params[:id]
        location = id.split(LOCATION_PREFIX)[1] rescue ""
        id = id.split(LOCATION_PREFIX)[0] rescue id
        id = id.delete_prefix("did:pplc:")

        @log = Log.find_by_oyd_hash(id)
---
SELECT  "logs".* FROM "logs" WHERE "logs"."oyd_hash" = ? LIMIT ?  [["oyd_hash", "zQmWkDUAQzoF72WqyYdo4wujZEoof2rH9T76sANChoB1RJB"], ["LIMIT", 1]]